In [1]:
import pandas as pd

In [2]:
data = {'Date' : ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'], 
        'City' : ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
        'Sales' : [100, 150, 200, 120]}

In [3]:
df = pd.DataFrame(data)
df

         Date         City  Sales
0  2023-01-01     New York    100
1  2023-01-01  Los Angeles    150
2  2023-01-02     New York    200
3  2023-01-02  Los Angeles    120

In [5]:
pivot_df = df.pivot_table(values='Sales', index='Date', columns='City')
pivot_df

City        Los Angeles  New York
Date
2023-01-01        150.0     100.0
2023-01-02        120.0     200.0

In [7]:
# Example 2: Multiple Aggregations
pivot_df = df.pivot_table(values='Sales', index='Date', columns='City', aggfunc=['sum', 'mean'])
pivot_df

                   sum                 mean
City       Los Angeles New York Los Angeles New York
Date
2023-01-01         150      100       150.0    100.0
2023-01-02         120      200       120.0    200.0

In [9]:
# Example 3: Using Margins (summary statistic is mean)
pivot_df = df.pivot_table(values='Sales', index='Date', columns='City', margins=True)
pivot_df

City        Los Angeles  New York    All
Date
2023-01-01        150.0     100.0  125.0
2023-01-02        120.0     200.0  160.0
All               135.0     150.0  142.5